# This is an example configuration file for DHCPv6 server in Kea.
# It provides parameters controlling processing of expired leases,
# a.k.a. leases reclamation.

{ "Dhcp6":

{
# Kea is told to listen on ethX interface only.
  "interfaces-config": {
    "interfaces": [ "ethX" ]
  },

# We need to specify lease type. As of May 2014, three backends are supported:
# memfile, mysql and pgsql. We'll just use memfile, because it doesn't require
# any prior set up.
  "lease-database": {
    "type": "memfile"
  },

# The following parameters control processing expired leases. Expired leases
# will be reclaimed periodically according to the "reclaim-timer-wait-time"
# parameter. Reclaimed leases will be held in the database for 1800s to
# facilitate lease affinity. After this period the leases will be removed.
# The frequency of removal is controlled by the "flush-reclaimed-timer-wait-time"
# parameter. The lease reclamation routine will process at most 500 leases
# or will last for at most 100ms, during a single run. If there are still
# some unreclaimed leases after 10 attempts, a warning message is issued.
  "expired-leases-processing": {
    "reclaim-timer-wait-time": 5,
    "flush-reclaimed-timer-wait-time": 10,
    "max-reclaim-leases": 500,
    "max-reclaim-time": 100,
    "hold-reclaimed-time": 1800,
    "unwarned-reclaim-cycles": 10
  },

# Addresses will be assigned with preferred and valid lifetimes
# being 3000 and 4000, respectively. Client is told to start
# renewing after 1000 seconds. If the server does not respond
# after 2000 seconds since the lease was granted, client is supposed
# to start REBIND procedure (emergency renewal that allows switching
# to a different server).
  "preferred-lifetime": 3000,
  "valid-lifetime": 4000,
  "renew-timer": 1000,
  "rebind-timer": 2000,

# The following list defines subnets. Each subnet consists of at
# least subnet and pool entries.
  "subnet6": [
    {
      "pools": [ { "pool": "2001:db8:1::/80" } ],
      "subnet": "2001:db8:1::/64",
      "interface": "ethX"
    }
  ]
},

# The following configures logging. Kea will log all debug messages
# to /var/log/kea-debug.log file.
"Logging": {
    "loggers": [
        {
            "name": "kea-dhcp6",
            "output_options": [
                {
                    "output": "/var/log/kea-debug.log"
                }
            ],
            "debuglevel": 99,
            "severity": "DEBUG"
        }
    ]
}

}

