// Note the *.json files are to be processed by api2doc.py and possibly other
// JSON tools that do not handle comments. If using this template, make sure you
// have all the comments removed.
{
    // This specifies the name of the command. Must be the same as the filename.
    "name": "template-command",

    // This provides a short description. Since JSON does not support multi-line
    // strings, each line is a separate string. Feel free to have one long string,
    // or several lines of nicely wrapped text.
    "brief": [ "a sentence or two explaining what it is" ],

    // This provides a full description. Since we have most (all?) commands
    // already documented, we don't want to copy over the text. Instead,
    // we provide links to specific section.
    "description": "See :ref:`anchor-in-the-docs`/>",

    // This enumerates the daemons that are able to handle specific commands.
    // Usually this will be a subset of those specified below as there are very
    // few commands that are supported by every daemon.
    "support": [ "kea-dhcp4", "kea-dhcp6", "dhcp-ddns", "ca", "netconf" ],

    // Historical information. May need a bit of digging, but this info can
    // be extracted by looking at older Kea user guides. We have them published
    // on FTP.
    "avail": "first version the command appeared in",

    // Many commands are provided by a hook. Specify the name of the hook here.
    // If this hook is provided by the daemons natively (without needing to load
    // a hook), remove the whole "hook" entry.
    "hook": "name of the hook that provides this command. remove if provided by the core code",

    // This defines the read or write access. Default is write access
    // to not leave unrestricted access to a dangerous command by accident.
    "access": "write",

    // This defines the syntax of the command.
    "cmd-syntax": [ "Syntax of the command" ],

    // This defines a description printed immediately below the command syntax.
    "cmd-comment": [ "Possibly some extra comments after the syntax." ],

    // This defines the syntax of the response.
    "resp-syntax": [ "Syntax of the response" ],

    // This defines a description printed immediately below the response syntax.
    "resp-comment": [ "Optional extra comments after the response syntax." ]
}
