// This is a simple example of a configuration for Netconf.
// This server provides YANG interface for all Kea servers and agent.
{
    "Netconf":
    {
        // This map specifies how each server is managed:
        // the YANG model to use and the control channel.
        // Currently three control channel types are supported:
        // "stdout" which output the configuration on the standard output,
        // "unix" which uses the local control channel supported by
        // "dhcp4" and "dhcp6" servers ("d2" support is not yet merged),
        // and "http" which uses the Control agent "ca" to manage itself or
        // to forward commands to "dhcp4" or "dhcp6" (same comment about "d2".
        "managed-servers":
        {
            // This is how Netconf can communicate with the DHCPv4 server.
            "dhcp4":
            {
                "comment": "DHCP4 server",
                "model": "kea-dhcp4-server",
                "control-socket":
                {
                    "type": "unix",
                    "name": "/path/to/the/unix/socket-v4"
                }
            },

            // DHCPv6 parameters.
            "dhcp6":
            {
                "model": "kea-dhcp6-server",
                "control-socket":
                {
                    "type": "unix",
                    "name": "/path/to/the/unix/socket-v6"
                }
            },

            // Currently the DHCP-DDNS (nicknamed D2) server does not support
            // command channel yet.
            "d2":
            {
                "model": "kea-dhcp-ddns",
                "control-socket":
                {
                    "type": "stdout",
                    "user-context": { "in-use": false }
                }
            },

            // Of course the Control Agent (nicknamed CA) supports HTTP.
            "ca":
            {
                "model": "kea-ctrl-agent",
                "control-socket":
                {
                    "type": "http",
                    "host": "127.0.0.1",
                    "port": 8000
                }
            }
        },

        // Netconf is able to load hook libraries that augment its operation.
        // The primary functionality is the ability to add new commands.
        "hooks-libraries": [
            // Hook libraries list may contain more than one library.
            {
                // The only necessary parameter is the library filename.
                "library": "/opt/local/netconf-commands.so",

                // Some libraries may support parameters. Make sure you
                // type this section carefully, as the CA does not validate
                // it (because the format is library specific).
                "parameters": {
                    "param1": "foo"
                }
            }
        ]

    },

    // Similar to other Kea components, Netconf also uses logging.
    "Logging":
    {
        "loggers": [
            {
                "name": "kea-netconf",
                "output_options": [
                    {
                        "output": "/var/log/kea-netconf.log",
                        // Several additional parameters are possible in addition
                        // to the typical output. Flush determines whether logger
                        // flushes output to a file. Maxsize determines maximum
                        // filesize before the file is being rotated. maxver
                        // specifies the maximum number of rotated files being
                        // kept.
                        "flush": true,
                        "maxsize": 204800,
                        "maxver": 4
                    }
                ],
                "severity": "INFO",
                "debuglevel": 0
            }
        ]
    }
}
