{
    "access": "read",
    "avail": "1.6.0",
    "brief": [
        "This command fetches all global parameters for the server from the specified database."
    ],
    "cmd-comment": [
        "The ``server-tags`` list is mandatory and must contain exactly one server tag. Specifying an empty list, a value of ``null``, or multiple server tags will result in an error. The special server tag \"all\" is allowed; it fetches the global parameters shared by all servers."
    ],
    "cmd-syntax": [
        "{",
        "    \"command\": \"remote-global-parameter4-get-all\",",
        "    \"arguments\": {",
        "        \"remote\": {",
        "            <specification of the database to connect to>",
        "        },",
        "        \"server-tags\": [ <single server tag as string> ]",
        "    }",
        "}"
    ],
    "hook": "cb_cmds",
    "name": "remote-global-parameter4-get-all",
    "resp-comment": [
        "The returned response contains a list of maps. Each map contains a global parameter name/value pair. The value may be a JSON string, integer, real, or boolean. The metadata is appended to each parameter and provides database-specific information associated with the returned objects. If the server tag \"all\" is included in the command, the response contains the global parameters shared among all servers. It excludes server-specific global parameters. If an explicit server tag is included in the command, the response contains all global parameters directly associated with the given server, and the global parameters associated with all servers when server-specific values are not present."
    ],
    "resp-syntax": [
        "{",
        "    \"result\": 0,",
        "    \"text\": \"DHCPv4 global parameters found.\",",
        "    \"arguments\": {",
        "        \"parameters\": [",
        "            {",
        "                <first parameter name>: <first parameter value>,",
        "                \"metadata\": {",
        "                    \"server-tags\": [ <server tag> ]",
        "                }",
        "            },",
        "            {",
        "                <second parameter name>: <second parameter value>,",
        "                \"metadata\": {",
        "                    \"server-tags\": [ <server tag> ]",
        "                }",
        "            }",
        "        ],",
        "        \"count\": 2",
        "    }",
        "}"
    ],
    "support": [
        "kea-dhcp4"
    ]
}
